Revit 2027 API
PrintParameters.UserDefinedMarginY Property
Note: This API is now obsolete.
 The User defined Y value of offset from left bottom corner. Unit is inch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This property is obsolete. Use OriginOffsetY instead.")]
public double UserDefinedMarginY { get; set; }
<ObsoleteAttribute("This property is obsolete. Use OriginOffsetY instead.")>
Public Property UserDefinedMarginY As Double
	Get
	Set
public:
[ObsoleteAttribute(L"This property is obsolete. Use OriginOffsetY instead.")]
property double UserDefinedMarginY {
	double get ();
	void set (double value);
}
[<ObsoleteAttribute("This property is obsolete. Use OriginOffsetY instead.")>]
member UserDefinedMarginY : float with get, set
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  Thrown if PaperPlacement is not Margins and MarginType is not User defined type.
See Also
Reference
PrintParameters Class
Autodesk.Revit.DB Namespace